ui/backend/audit/cases/backward_facing_step/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | AI-CFD-V2 M2 step 1: backward_facing_step       |
|  \\    /   O peration     | OpenFOAM 11                                     |
|   \\  /    A nd           | Driver-Seegmiller geometry (NASA TMR ref)       |
|    \\/     M anipulation  | H = 0.0127 m (0.5 in step)                      |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Step height (Driver-Seegmiller used 0.5 inch).
// Domain: 3-block L-shape
//   B0: upstream channel       x in [-4H, 0],  y in [ 0, 9H], z in [0, 0.5H]
//   B1: downstream upper       x in [ 0, 30H], y in [ 0, 9H], z in [0, 0.5H]
//   B2: downstream step zone   x in [ 0, 30H], y in [-H, 0],  z in [0, 0.5H]
//
// Patches:
//   inlet              — B0 left face (x = -4H)
//   outlet             — B1+B2 right faces (x = 30H)
//   topWall            — B0+B1 top faces (y = 9H)
//   bottomWall         — B0 bottom (y=0, x in [-4H,0]) + B2 bottom (y=-H, x in [0,30H])
//   stepFace           — B2 left face (x=0, y in [-H, 0]) — the canonical step
//   frontAndBack       — z-min + z-max faces (empty, 2.5D)

scale 0.0127;  // step height H = 0.0127 m; vertices below expressed in units of H

vertices
(
    // Bottom face (z=0)
    (-4   0    0)      // 0
    ( 0   0    0)      // 1
    ( 0   9    0)      // 2
    (-4   9    0)      // 3
    ( 30  0    0)      // 4
    ( 30  9    0)      // 5
    ( 0  -1    0)      // 6
    ( 30 -1    0)      // 7
    // Top face (z = 0.5H)
    (-4   0    0.5)    // 8
    ( 0   0    0.5)    // 9
    ( 0   9    0.5)    // 10
    (-4   9    0.5)    // 11
    ( 30  0    0.5)    // 12
    ( 30  9    0.5)    // 13
    ( 0  -1    0.5)    // 14
    ( 30 -1    0.5)    // 15
);

blocks
(
    // B0: upstream channel (-4H..0, 0..9H)
    // Grading: refine toward bottom wall (y=0) for boundary layer
    hex (0 1 2 3   8 9 10 11)
        (40 50 1)
        simpleGrading (1 30 1)

    // B1: downstream upper (0..30H, 0..9H)
    // Grading: refine toward x=0 (step expansion shock) and y=0 (recirculation shear layer)
    hex (1 4 5 2   9 12 13 10)
        (120 50 1)
        simpleGrading (4 30 1)

    // B2: downstream step zone (0..30H, -H..0)
    // Grading: refine toward both walls (bottom + step face)
    hex (6 7 4 1   14 15 12 9)
        (120 30 1)
        simpleGrading (4 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 3 11 8)            // B0 west face
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (4 5 13 12)           // B1 east face
            (7 4 12 15)           // B2 east face
        );
    }
    topWall
    {
        type wall;
        faces
        (
            (3 2 10 11)           // B0 top
            (2 5 13 10)           // B1 top
        );
    }
    bottomWall
    {
        type wall;
        faces
        (
            (0 1 9 8)             // B0 bottom (upstream of step)
            (6 7 15 14)           // B2 bottom (downstream of step)
        );
    }
    stepFace
    {
        type wall;
        faces
        (
            (1 6 14 9)            // B2 west face — the vertical step
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 1 2 3)             // B0 z-min
            (1 4 5 2)             // B1 z-min
            (6 7 4 1)             // B2 z-min
            (8 9 10 11)           // B0 z-max
            (9 12 13 10)          // B1 z-max
            (14 15 12 9)          // B2 z-max
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
